package com.example.news;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import androidx.activity.EdgeToEdge;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.graphics.Insets;
import androidx.core.view.ViewCompat;
import androidx.core.view.WindowInsetsCompat;

import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;

public class MainActivity extends AppCompatActivity {

    ListView MY_VIEW;

    ArrayList <HashMap <String,String>> arrayList = new ArrayList();
    HashMap <String,String> hashMap ;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        EdgeToEdge.enable(this);
        setContentView(R.layout.activity_main);
        ViewCompat.setOnApplyWindowInsetsListener(findViewById(R.id.main), (v, insets) -> {
            Insets systemBars = insets.getInsets(WindowInsetsCompat.Type.systemBars());
            v.setPadding(systemBars.left, systemBars.top, systemBars.right, systemBars.bottom);
            return insets;
        });
        MY_VIEW = findViewById(R.id.MY_VIEW);


        TV_NEWS();

        button.setOnClickListener(v -> {

        });



        MTADAPTER MYadapter = new MTADAPTER();
        MY_VIEW.setAdapter(MYadapter);
    }

    public class MTADAPTER extends BaseAdapter {
        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int i) {
            return null;
        }

        @Override
        public long getItemId(int i) {
            return 0;
        }

        @Override
        public View getView(int i, View view, ViewGroup viewGroup) {
            LayoutInflater layoutInflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);

            View mynewv = layoutInflater.inflate(R.layout.new_tm,viewGroup,false);

            TextView TV_NAME = mynewv.findViewById(R.id.TV_NAME);
            TextView TV_ONER = mynewv.findViewById(R.id.TV_ONER);
            TextView NEWS_TITLE = mynewv.findViewById(R.id.NEWS_TITLE);
            TextView NEWS_DEC = mynewv.findViewById(R.id.NEWS_DEC);

            ImageView TV_LOGO = mynewv.findViewById(R.id.TV_LOGO);
            ImageView NEWS_IMAGE = mynewv.findViewById(R.id.NEWS_IMAGE);

            LinearLayout lclike = mynewv.findViewById(R.id.lclike);

            HashMap<String,String> hashMap = arrayList.get(i);

            String TV_NAME1 = hashMap.get("TV_NAME");
            String TV_ONER1 = hashMap.get("TV_ONER");
            String NEWS_TITLE1 = hashMap.get("NEWS_TITLE");
            String NEWS_DEC1 = hashMap.get("NEWS_DEC");

            String TV_LOGO1 = hashMap.get("TV_LOGO");
            String NEWS_IMAGE1 = hashMap.get("NEWS_IMAGE");


            Picasso.get().load(TV_LOGO1).into(TV_LOGO);
            Picasso.get().load(NEWS_IMAGE1).into(NEWS_IMAGE);

            TV_NAME.setText(TV_NAME1);
            TV_ONER.setText(TV_ONER1);
            NEWS_TITLE.setText(NEWS_TITLE1);
            NEWS_DEC.setText(NEWS_DEC1);

            lclike.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {

                    MainActivity2.title = NEWS_TITLE1;
                    MainActivity2.des = NEWS_DEC1;
                    MainActivity2.NAME = TV_NAME1;
                    MainActivity2.ONER = TV_ONER1;


                    Bitmap bitmap = ((BitmapDrawable) NEWS_IMAGE.getDrawable()).getBitmap();
                    MainActivity2.MyBitmap = bitmap;

                    Bitmap bitmap1 = ((BitmapDrawable) TV_LOGO.getDrawable()).getBitmap();
                    MainActivity2.MyBitmaplogo = bitmap1;

                    startActivity(new Intent(MainActivity.this, MainActivity2.class));
                }
            });


            return mynewv;
        }
    }


    public void TV_NEWS (){

        hashMap = new HashMap<>();
        hashMap.put("TV_NAME","Somoy TV");
        hashMap.put("TV_ONER","Somoy Media Limited");
        hashMap.put("NEWS_TITLE","আজ কোথায় কী?");
        hashMap.put("NEWS_DEC","দেশে প্রতিদিন নানা কর্মসূচি পালন করে সরকারের বিভিন্ন দফতর, সংস্থা, বিভিন্ন রাজনৈতিক দল ও অনেক সংগঠন। শনিবার (১৪ ফেব্রুয়ারি) উল্লেখযোগ্য কর্মসূচির মধ্যে কী কী আছে, দিনের শুরুতেই তা জেনে নিতে পারেন।\nতারেক রহমানের সংবাদ সম্মেলন\n" +
                " \n" +
                "\n" +
                "ত্রয়োদশ জাতীয় সংসদ নির্বাচন রেকর্ড বিজয়ের পর সংবাদ সম্মেলনে আসছেন বিএনপির চেয়ারম্যান তারেক রহমান। বিকেল ৩টায় হোটেল ইন্টারকন্টিনেন্টালে সংবাদ সম্মেলন করবেন তিনি।\n" +
                "\n" +
                "বিএনপির মিডিয়া সেল থেকে বলা হয়েছে, সংবাদ সম্মেলনে নির্বাচন নিয়ে আনুষ্ঠানিক প্রতিক্রিয়া দেবে দলটি। সংবাদ সম্মেলনে বক্তব্য দেবেন বিএনপি চেয়ারম্যান তারেক রহমান।\nবেলা ১১টায় বেইলি রোডে ফরেন সার্ভিস একাডেমিতে সংবাদ সম্মেলন করবেন প্রধান উপদেষ্টার বিশেষ সহকারী অধ্যাপক আলী রীয়াজ।\n" +
                " \n" +
                "ইশরাকের কর্মসূচি\n" +
                " \n" +
                "\n" +
                "দলের নিরঙ্কুশ বিজয়ে শুকরিয়া আদায় এবং বেগম খালেদা জিয়ার বিদেহী আত্মার মাগফিরাত কামনায় বাদ আসর ওয়ারী নির্বাচনী কার্যালয়ে যাবেন ঢাকা-৬ আসনের নব নির্বাচিত সংসদ সদস্য ইশরাক হোসেন।");
        hashMap.put("TV_LOGO","https://www.somoynews.tv/icon.png");
        hashMap.put("NEWS_IMAGE","https://d2u0ktu8omkpf6.cloudfront.net/43caf6589ea089f677742b4c8f2559cce93f87ab82c0e626.jpg");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("TV_NAME","Jamuna TV");
        hashMap.put("TV_ONER","Jamuna Group");
        hashMap.put("NEWS_TITLE","যমুনার ইউটিউব চ্যানেলে আড়াই কোটি মানুষের আস্থা");
        hashMap.put("NEWS_DEC","৪ ডিসেম্বর, বুধবার দিবাগত রাত। আরও একটি সম্ভাবনাময় সকালের শুরুর অপেক্ষায় কেউ কেউ ঘুমিয়ে পড়েছেন। কেউ আবার বিছানায় গা এলিয়ে নজর রাখছিলেন মোবাইলের স্ক্রিনে, তাদের কেউ কেউ নিশ্চয় ডিজিটালমাধ্যমে দিনের খবরগুলোয় চোখ বুলিয়ে নিচ্ছিলেন। কিংবা ভিনদেশ থেকে বাংলাদেশের খবর জানতে চোখ রাখছিলেন কোনো বাংলাভাষী। যারা সঠিক সংবাদটি পেতে বেছে নিচ্ছেন বাংলাদেশের যমুনা টেলিভিশনের ডিজিটালমাধ্যমগুলো।\n\nসঠিক সংবাদ পেতে প্রতিদিনই এই আস্থা রাখার তালিকায় যুক্ত হচ্ছেন নতুন নতুন মানুষ। বুধবার রাতও এর ব্যতিক্রম নয়। তাই দর্শক-পাঠকের আস্থায় এই রাতে যমুনা টেলিভিশনের ইউটিউব চ্যানেল পৌঁছে গেছে আরও একটি মাইলফলকে। যমুনা টেলিভিশনের ইউটিউব চ্যানেলে এখন আড়াই কোটির বেশি সাবস্ক্রাইবার।\n" +
                "\n" +
                "\n" +
                "\n" +
                "এই অগ্রযাত্রায় চ্যানেলটি দুই হাজার ১৪৮ কোটিবারের বেশি ভিউ হয়েছে। বাংলাদেশের সংবাদমাধ্যমের ইতিহাসে যা বিরল। দ্রুততা ও সময়ের বিচারে এই অর্জন একটি রেকর্ডও বটে।\n" +
                "\n" +
                "\n" +
                "\n" +
                "২০১৭ সালের ১১ ডিসেম্বর যাত্রা শুরু করে যমুনা টিভি (Jamuna TV) নামের ইউটিউব চ্যানেলটি। বস্তুনিষ্ঠ ও বৈচিত্র্যময় কন্টেন্টের মাধ্যমে দ্রুততম সময়েই দর্শকপ্রিয়তা অর্জন করে চ্যানেলটি। ৮ মাসেরও কম সময়ে ২০১৮ সালের ৩ আগস্ট স্পর্শ করে ১ লাখের মাইলফলক। পরের বছরই (২০১৯ সালের ৩০ মে) সেটি দশগুণ বৃদ্ধি পায়, ১০ লাখের অভিজাত ক্লাবে প্রবেশ করে যমুনা টেলিভিশন। তারপরের গল্প তো কেবল এগিয়ে যাওয়ার।\n" +
                "\n" +
                "\n" +
                "\n" +
                "২০২০ সালের ১৫ জুলাই ৫০ লাখ সাবস্ক্রাইবের গৌরব অর্জন করে টিম যমুনা। স্বপ্নের ১ কোটি সাবস্ক্রাইবারের মাইলফলকে পৌঁছে বাইশের ৪ মার্চ! এরপর যেন গতি আরও বেড়ে চলে টিম যমুনার। আড়াই বছরের মাথায় পৌঁছে গেলো আড়াই কোটি সাবস্ক্রাইবারের ক্লাবে।\n" +
                "\n" +
                "\n" +
                "\n" +
                "এরমধ্যে চব্বিশ যেন যমুনা টেলিভিশনের নিজেকে পুরোপুরি মেলে ধরার বছর। ৭ জানুয়ারির সংসদ নির্বাচনে যমুনা শব্দটি হয়ে উঠে মানুষের মুখে মুখে। যমুনার বস্তুনিষ্ঠ সংবাদে দর্শক-পাঠকের আস্থা ও ভালোবাসায় ভোটের পরপরই ২০ জানুয়ারি সংবাদভিত্তিক ইউটিউব চ্যানেলের বিশ্ব চূড়ায় উঠে বাংলাদেশের এ গণমাধ্যম। তারও আগে তো বাংলাদেশের এক নম্বর ইউটিউব চ্যানেলের তকমা জুটিয়েছিল। সে সময় যমুনা টিভির ইউটিউবে সাবস্ক্রাইবার ছিল ১ কোটি ৬২ লাখ।\n" +
                "\n" +
                "\n" +
                "\n" +
                "বিশ্বের সেরা হয়েও আত্মতৃপ্তিতে ভোগেনি টিম যমুনা। নিজেরা আরও পেশাদারিত্বের পরিচয় দিয়েছে। সেই চেষ্টা তো দেশবাসী দেখেছেই।\n" +
                "\n" +
                "\n" +
                "\n" +
                "জুলাই-আগস্টে আন্দোলনে সংবাদ পেতে বাংলাভাষী মানুষের আগ্রহের কেন্দ্রবিন্দুতে ছিল যমুনা নিউজ। সে সময় বস্তুনিষ্ঠ সংবাদ প্রকাশে এই গণমাধ্যম ছিল অবিচল। বাংলা ব্লকেড থেকে শুরু করে রংপুরে আবু সাঈদ হত্যার পর শিক্ষার্থীদের কমপ্লিট শাটডাউন ও একদফা কর্মসূচি, শেখ হাসিনার পতন, খালেদা জিয়ার মুক্তি, বিএনপির সমাবেশ, অন্তর্বর্তী সরকার গঠন— প্রতিটি সংবাদ প্রকাশে আবেগ নয়, সাংবাদিকতার নীতি-নৈতিকতা মেনে মুন্সিয়ানার পরিচয় দিয়েছে টিম যমুনা। একাধিক আন্তর্জাতিক গণমাধ্যমও এ সময় বাংলাদেশের এই টেলিভিশনের তথ্য ব্যবহার করে।\n" +
                "\n" +
                "\n" +
                "\n" +
                "রংপুরে নিরস্ত্র শিক্ষার্থী আবু সাঈদকে গুলি করে মারার ভিডিও বিশ্ববাসী দেখতে পায় যমুনার মাধ্যমে। দেশীয়র পাশাপাশি বিশ্ব গণমাধ্যমেও তখন যমুনার বরাতে আবু সাঈদকে গুলি করার ভিডিও বা চিত্র প্রকাশ করে। যেই ঘটনা, সংবাদ পুরো আন্দোলনকে নিয়ে যায় ভিন্ন মাত্রায়। যা মসনদে পর্যন্ত পরিবর্তন এনে দেয়।\n" +
                "\n" +
                "\n" +
                "\n" +
                "যমুনার সংবাদ প্রকাশে এমন মুন্সিয়ানায় গণঅভ্যুথানের আগের দিন যমুনা টেলিভিশনের ইউটিউব চ্যানেলের সাবস্ক্রাইবার ২ কোটিতে পৌঁছায়। তাদের আস্থা-ভালোবাসা এখানেই সীমাবদ্ধ থাকেনি। সামাজিক যোগাযোগমাধ্যমে চলে যমুনার বন্দনা। নগরীর দেয়ালে দেয়ালে রঙ তুলিতে আঁকা হয় যমুনার মাইক্রোফোন, লোগো, ওয়েবসাইটের ঠিকানা।\n" +
                "\n" +
                "\n" +
                "\n" +
                "তাদের এই ভালোবাসার প্রতিদানে মাত্র চার মাসের ব্যবধানে যমুনার ইউটিউব চ্যানেল পেলো আরও ৫০ লাখ সাবস্ক্রাইবার। তাতেই ৫ ডিসেম্বর আড়াই কোটির এই মাইলফলক অর্জন।\n" +
                "\n" +
                "\n" +
                "\n" +
                "এমন অর্জনের প্রতিক্রিয়ায় যমুনার দর্শক ও শুভানুধ্যায়ীদের প্রতি কৃতজ্ঞতা জানিয়েছেন যমুনা টেলিভিশনের প্রধান নির্বাহী কর্মকর্তা ফাহিম আহমেদ। তিনি বলেন, বস্তুনিষ্ঠতা টিম যমুনার সর্বোচ্চ অগ্রাধিকার। মানুষের তথ্যের চাহিদা মেটানোর পাশাপাশি বৈচিত্র্যের বিষয়টিতেও গুরুত্ব দিয়ে থাকি। সেই অঙ্গীকার নিয়েই মানুষের কাছে সর্বশেষ তথ্যটি সবার আগে পৌঁছে দেয় যমুনা টেলিভিশন। আড়াই কোটি মানুষের এ ভালোবাসা আমাদের সার্থকতার প্রতিচ্ছবি ও পথচলার অনুপ্রেরণা হয়ে থাকবে।\n" +
                "\n" +
                "\n" +
                "\n" +
                "টিম যমুনা মনে করে, দর্শক, পাঠক ও শুভানুধ্যায়ীরাও এই এগিয়ে যাওয়ায় সারথী। তারা যমুনায় আস্থা রেখেছেন, ভালোবেসেছেন। তাই তাদের প্রতি রইলো টিম যমুনার অভিবাদন। এই ভালোবাসা টিম যমুনাকে মনে করিয়ে দেয় আরও দায়িত্বশীল হওয়ার কথা। নিজেকে নিজের আরও ছাড়িয়ে যাওয়ার গল্প বলার কথা। হয়তো তাদের কেউ কেউ টিম যমুনার উদ্দেশে আনমনে গাইছেন আইয়ুব বাচ্চুর গাওয়া—\n" +
                "\n" +
                "\n" +
                "\n" +
                "বহুদুর যেতে হবে\n" +
                "এখনও পথের অনেক রয়েছে বাকি।\n" +
                "ভালোবাসায় বিশ্বাস রেখো\n" +
                "হয়তো অচেনা মনে হতে পারে আমাকে।\n" +
                "তুমি ভয় পেয়ো না, তুমি থেমে যেও না...\n" +
                "\n" +
                "\n" +
                "\n" +
                "ভালোবাসা দেয়া দর্শক-পাঠকদের উদ্দেশে টিম যমুনা আশ্বস্ত করতে চায়— আমাদের মনে বাজতে থাকে, ‘ক্লান্তি আমায় ক্ষমা করো প্রভু…’। আমরা একটা উদ্যোমী টিম। এই উদ্যোম কাজে লাগিয়েই লক্ষ-কোটি মানুষের ভালোবাসার প্রতিদান দিতে চাই।");
        hashMap.put("TV_LOGO","https://play-lh.googleusercontent.com/HB_K5ZUcWFfYBcST4buqJ_Oq3g16g4F8jbWLV3jrytGLcWks9ld0R_8ccdxDS_9gqPyP=w600-h300-pc0xffffff-pd");
        hashMap.put("NEWS_IMAGE","https://jamuna.tv/uploads/news_photos/2024/12/05/jamuna-25-million-subscriber.jpg");
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("TV_NAME","ATN News");
        hashMap.put("TV_ONER","ATN Bangla Group");
        hashMap.put("NEWS_TITLE","তারেক রহমানকে বিজয়ের শুভেচ্ছা মার্কিন দূতাবাসের");
        hashMap.put("NEWS_DEC","ত্রয়োদশ জাতীয় সংসদ নির্বাচনে বিজয়ের জন্য বিএনপি ও দলটির চেয়ারম্যান তারেক রহমানকে শুভেচ্ছা জানিয়েছে ঢাকার মার্কিন দূতাবাস। শুক্রবার সকাল ৭টা ৪৮ মিনিটে ঢাকার মার্কিন দূতাবাসের ভেরিফায়েড ফেসবুক পেজে দেওয়া এক পোস্টে এই শুভাচ্ছে জানানো হয়।\n" +
                "\n" +
                "পোস্টে বলা হয়, ‘একটি সফল নির্বাচন আয়োজনের জন্য বাংলাদেশের জনগণকে অভিনন্দন। বিএনপি এবং তারেক রহমানকে তাঁদের ঐতিহাসিক বিজয়ের শুভেচ্ছা।’\n" +
                "\n" +
                "ঢাকার মার্কিন দূতাবাসের ফেসবুক পোস্টে আরও বলা হয়, ‘আমাদের দুই দেশের সমৃদ্ধি ও নিরাপত্তার অভিন্ন লক্ষ্য বাস্তবায়নে আপনাদের সাথে কাজ করার জন্য যুক্তরাষ্ট্র আগ্রহী।’\n" +
                "\n" +
                "রিপোর্ট : এটিএন নিউজ/জেড.এস");
        hashMap.put("TV_LOGO","https://www.atnnewstv.com/assets/img/logo@1x.webp");
        hashMap.put("NEWS_IMAGE","https://www.atnnewstv.com/assets/img/full/26624.webp?width=1280&height=720");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("TV_NAME","Independent TV");
        hashMap.put("TV_ONER","Beximco Group");
        hashMap.put("NEWS_TITLE", "সংসদে সতর্ক, নীতিবান ও শান্তিপূর্ণ বিরোধীদলের ভূমিকা রাখবে জামায়াত: জামায়াত আমির");
        hashMap.put("NEWS_DEC","জামায়াতে ইসলামী জাতীয় সংসদে সতর্ক, নীতিবান ও শান্তিপূর্ণ বিরোধীদলের ভুমিকা পালন করবে বলে জানিয়েছেন দলটির আমির ডা. শফিকুর রহমান। শুক্রবার দিবাগত রাতে নিজের ভেরিফায়েড ফেসবুক পেজে এক পোস্টে এ কথা জানান তিনি।\nজামায়াতে ইসলামী জাতীয় সংসদে সতর্ক, নীতিবান ও শান্তিপূর্ণ বিরোধীদলের ভুমিকা পালন করবে বলে জানিয়েছেন দলটির আমির ডা. শফিকুর রহমান। শুক্রবার দিবাগত রাতে নিজের ভেরিফায়েড ফেসবুক পেজে এক পোস্টে এ কথা জানান তিনি।\n" +
                "\n" +
                "ফেসবুক পোস্টে তিনি লেখেন, ‘গত কয়েক মাস ধরে অক্লান্ত পরিশ্রম করা অসংখ্য স্বেচ্ছাসেবক ও সমর্থকদের প্রতি আমি গভীর শ্রদ্ধা ও কৃতজ্ঞতা জানাই। আপনারা অনেকেই সময়, শ্রম ও বিশ্বাস উৎসর্গ করেছেন। কেউ কেউ শুধুমাত্র গণতান্ত্রিক অধিকার প্রয়োগের কারণে ভয়ভীতি ও হয়রানির মুখোমুখি হয়েছেন। আপনাদের সাহস আমাদের গণতন্ত্রকে আরও শক্তিশালী করেছে।’");
        hashMap.put("TV_LOGO","https://cdn.itvbd.net/contents/themes/public/style/images/logo.png");
        hashMap.put("NEWS_IMAGE","https://cdn.itvbd.net/contents/cache/images/720x404x1/uploads/media/2026/02/09/7678d1453ab6b6ae5ff8f386b1a64309-6989e258b6379.jpg?jadewits_media_id=154303");
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("TV_NAME","BanglaVision");
        hashMap.put("TV_ONER","BanglaVision Group");
        hashMap.put("NEWS_TITLE","তারেক রহমানকে অভিনন্দন জানালেন প্রধান উপদেষ্টা");
        hashMap.put("NEWS_DEC","ত্রয়োদশ জাতীয় সংসদ নির্বাচনে বিপুল সংখ্যাগরিষ্ঠতা নিয়ে জয়লাভ করায় বাংলাদেশ জাতীয়তাবাদী দলের (বিএনপি) চেয়ারম্যান তারেক রহমানকে শুভেচ্ছা ও অভিনন্দন জানিয়ে বার্তা দিয়েছেন অন্তর্বর্তীকালীন সরকারের প্রধান উপদেষ্টা প্রফেসর মুহাম্মদ ইউনূস।\n\nঅভিনন্দন বার্তায় জনাব তারেক রহমানের উদ্দেশ্যে প্রধান উপদেষ্টা বলেন, ত্রয়োদশ জাতীয় সংসদ নির্বাচনে আপনার নেতৃত্বে বাংলাদেশ জাতীয়তাবাদী দল বিপুল সংখ্যাগরিষ্ঠতা অর্জন করায় আপনাকে আন্তরিক অভিনন্দন ও শুভেচ্ছা জানাচ্ছি। গণতান্ত্রিক উত্তরণের ঐতিহাসিক প্রক্রিয়ায় জনগণের এই সুস্পষ্ট রায় দেশের সাংবিধানিক ও গণতান্ত্রিক ধারাবাহিকতা এবং প্রাতিষ্ঠানিক স্থিতিশীলতার ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ মাইলফলক হয়ে থাকবে।\n" +
                "\n" +
                "\n" +
                "তিনি বলেন, আমি দৃঢ়ভাবে বিশ্বাস করি রাষ্ট্র পরিচালনার গুরুদায়িত্ব পালনের ক্ষেত্রে আপনার প্রজ্ঞা, গণতান্ত্রিক মূল্যবোধ ও জনকল্যাণমুখী চেতনার আলোকে আপনি দেশকে একটি স্থিতিশীল, অন্তর্ভুক্তিমূলক ও উন্নয়নমুখী পথে এগিয়ে নিয়ে যাবেন । আমি স্মরণ করছি আপনার পিতা রাষ্ট্রপতি জিয়াউর রহমান-এর আদর্শ ও রাষ্ট্রদর্শন এবং আপনার মাতা সাবেক প্রধানমন্ত্রী বেগম খালেদা জিয়ার আপসহীন নেতৃত্ব ও গণতন্ত্রের প্রতি অঙ্গীকারের কথা। তাদের আদর্শ ও মহান কর্ম আপনার আগামী দিনের চলার পথকে আলোকিত করবে বলে আমি একান্তভাবে আশা করি।\n" +
                "\n" +
                "প্রধান উপদেষ্টা বলেন, বাংলাদেশ আজ বৈশ্বিক পরিমণ্ডলে এক নতুন সম্ভাবনার দ্বারপ্রান্তে অবস্থান করছে। অর্থনৈতিক রূপান্তর, প্রযুক্তিগত অগ্রগতি, জলবায়ু সহনশীলতা, মানবসম্পদ উন্নয়ন এবং আঞ্চলিক ও আন্তর্জাতিক কূটনীতিতে সক্রিয় অংশগ্রহণ; এসব ক্ষেত্রে সুসমন্বিত মেধা, মননশীলতা ও প্রজ্ঞার প্রয়োগ অপরিহার্য। আশা করি, আপনার নেতৃত্বে জাতীয় ঐক্য সুদৃঢ় হবে এবং গণতান্ত্রিক মূল্যবোধ, আইনের শাসন ও জবাবদিহিমূলক শাসনব্যবস্থা আরও শক্তিশালী হবে।");
        hashMap.put("TV_LOGO","https://www.bvnews24.com/media/common/newbvlogo.png");
        hashMap.put("NEWS_IMAGE","https://www.bvnews24.com/media/imgAll/2024April/Tarek-Younus-1422026-2602140511.jpg");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("TV_NAME","News 24");
        hashMap.put("TV_ONER","East West Media Group");
        hashMap.put("NEWS_TITLE","বিএনপির প্রার্থীরা কে কোন আসনে বিজয়ী হলেন");
        hashMap.put("NEWS_DEC","ত্রয়োদশ জাতীয় সংসদ নির্বাচনে ২৯৯টি আসনের মধ্যে ২৯৭টি আসনের আনুষ্ঠানিক ফল ঘোষণা করেছে নির্বাচন কমিশন (ইসি)। এই নির্বাচনে সংখ্যাগরিষ্ঠ দল হিসেবে ২০৯টি আসনে এককভাবে জয় পেয়েছে বাংলাদেশ জাতীয়তাবাদী দল (বিএনপি)।\n" +
                "\n" +
                "আজ শুক্রবার (১৩ ফেব্রুয়ারি) দুপুরে রাজধানীর আগারগাঁওয়ে নির্বাচন ভবনে সাংবাদিকদের ব্রিফিংয়ে আনুষ্ঠানিক এই ফলাফল জানান ইসির জ্যেষ্ঠ সচিব আখতার আহমেদ।\n" +
                "\n" +
                "ইসির তথ্য অনুযায়ী একনজরে বিএনপির বিজয়ী প্রার্থীর তালিকা-\n\n\n" +
                "কক্সবাজার\n" +
                "\n" +
                "১. কক্সবাজার-১, সালাহউদ্দিন আহমদ (প্রাপ্ত ভোট: ২,২২,০১৯)।\n" +
                "২. কক্সবাজার-২, আলমগীর মুহাম্মদ মাহফুজ উল্লাহ ফরিদ (প্রাপ্ত ভোট: ১,২৫,৫৪৩)।\n" +
                "৩. কক্সবাজার-৩, লুৎফুর রহমান (প্রাপ্ত ভোট: ৮২,০৯৬)।\n" +
                "৪. কক্সবাজার-৪, শাহজাহান চৌধুরী (প্রাপ্ত ভোট: ১,২৩,৫৮২)।\n" +
                "\n" +
                "কিশোরগঞ্জ\n" +
                "\n" +
                "১. কিশোরগঞ্জ-১, মাজহারুল ইসলাম (প্রাপ্ত ভোট: ১,২২,৯৪৬)।\n" +
                "২. কিশোরগঞ্জ-২, এডভোকেট মো. জালাল উদ্দীন (প্রাপ্ত ভোট: ১,৪২,৬১৬)।\n" +
                "৩. কিশোরগঞ্জ-৩, ড. মুহাম্মদ ওসমান ফারুক (প্রাপ্ত ভোট: ১,১৩,২২৪)।\n" +
                "৪. কিশোরগঞ্জ-৪, মো. ফজলুর রহমান (প্রাপ্ত ভোট: ১,৩২,৫৫৩)।\n" +
                "৫. কিশোরগঞ্জ-৬, মো. শরীফুল আলম (প্রাপ্ত ভোট: ১,৮৫,৮৯৮)।\n" +
                "\n" +
                "কুমিল্লা\n" +
                "\n" +
                "১. কুমিল্লা-১, ড. খন্দকার মোশাররফ হোসেন (প্রাপ্ত ভোট: ১,৪০,৩০৫)।\n" +
                "২. কুমিল্লা-২, মো. সেলিম ভূঁইয়া (প্রাপ্ত ভোট: ৭৬,২৬৮)।\n" +
                "৩. কুমিল্লা-৩, কাজী শাহ মোফাজ্জাল হোসাইন (কায়কোবাদ) (প্রাপ্ত ভোট: ১,৫৮,০৯৩)।\n" +
                "৪. কুমিল্লা-৫, মো. জসীম উদ্দিন (প্রাপ্ত ভোট: ১,৯৯,৩১০)।\n" +
                "৫. কুমিল্লা-৬, মো. মনিরুল হক চৌধুরী (প্রাপ্ত ভোট: ১,৯৯,৩১০)।\n" +
                "৬. কুমিল্লা-৮, জাকারিয়া তাহের (প্রাপ্ত ভোট: ১,৬৯,১৭৮)।\n" +
                "৭. কুমিল্লা-৯, মো. আবুল কালাম (প্রাপ্ত ভোট: ১,৬৮,১০৮)।\n" +
                "৮. কুমিল্লা-১০, মো. মোবাশ্বের আলম ভুঁইয়া (প্রাপ্ত ভোট: ১,৬১,৮৪৭)।\n" +
                "\n" +
                "কুষ্টিয়া\n" +
                "\n" +
                "১. কুষ্টিয়া-১, রেজা আহাম্মেদ (প্রাপ্ত ভোট: ১,৬৫,০৮৫)।\n" +
                "\n" +
                "খাগড়াছড়ি\n" +
                "\n" +
                "১. খাগড়াছড়ি পার্বত্য জেলা, আবদুল ওয়াদুদ ভূঁঞা (প্রাপ্ত ভোট: ১,৫১,০৪০)।\n" +
                "\n" +
                "খুলনা\n" +
                "\n" +
                "১. খুলনা-১, আমীর এজাজ খান (প্রাপ্ত ভোট: ৬০,২৬৭)।\n" +
                "২. খুলনা-৩, রকিবুল ইসলাম (প্রাপ্ত ভোট: ৭৪,৮৪৫)।\n" +
                "৩. খুলনা-৪, এস কে আজিজুল বারী (প্রাপ্ত ভোট: ১,২৩,১৬২)।\n" +
                "৪. খুলনা-৫, মোহাম্মদ আলি আসগার (প্রাপ্ত ভোট: ১,৪৭,৬৫৮)।\n" +
                "\n" +
                "গাইবান্ধা\n" +
                "\n" +
                "১. গাইবান্ধা-৪, মোহাম্মদ শামীম কায়সার (প্রাপ্ত ভোট: ১,৪১,৭১২)।\n" +
                "\n" +
                "গাজীপুর\n" +
                "\n" +
                "১. গাজীপুর-১, মোঃ মজিবুর রহমান (প্রাপ্ত ভোট: ২,০৮,৬৮৮)।\n" +
                "২. গাজীপুর-২, এম মঞ্জুরুল করিম রনি (প্রাপ্ত ভোট: ১,৮৮,৬০৬)।\n" +
                "৩. গাজীপুর-৩, এস, এম, রফিকুল ইসলাম (প্রাপ্ত ভোট: ১,৬২,৩৪৩)।\n" +
                "৪. গাজীপুর-৫, এ, কে, এম, ফজলুল হক মিলন (প্রাপ্ত ভোট: ১,৩৩,৮৭৯)।\n" +
                "\n" +
                "গোপালগঞ্জ\n" +
                "\n" +
                "১. গোপালগঞ্জ-১, মোঃ সেলিমুজ্জামান মোল্যা (প্রাপ্ত ভোট: ৬৮,৮৬৭)।\n" +
                "২. গোপালগঞ্জ-২, কে এম বাবর (প্রাপ্ত ভোট: ৪০,০৪৮)।\n" +
                "৩. গোপালগঞ্জ-৩, এস এম জিলানী (প্রাপ্ত ভোট: ৬০,১৬৬)।\n" +
                "\n" +
                "চট্টগ্রাম\n" +
                "\n" +
                "১. চট্টগ্রাম-১, নুরুল আমিন (প্রাপ্ত ভোট: ১,২৭,৬৪৫)।\n" +
                "২. চট্টগ্রাম-৩, মোস্তফা কামাল পাশা (প্রাপ্ত ভোট: ৭৩,০৫৭)।\n" +
                "৩. চট্টগ্রাম-৫, মীর মোহাম্মদ হেলাল উদ্দিন (প্রাপ্ত ভোট: ১,৪৩,৯৬৫)।\n" +
                "৪. চট্টগ্রাম-৬, গিয়াস উদ্দিন কাদের চৌধুরী (প্রাপ্ত ভোট: ১,১১,২০১)।\n" +
                "৫. চট্টগ্রাম-৭, হুমাম কাদের চৌধুরী (প্রাপ্ত ভোট: ১,০১,৪৪৫)।\n" +
                "৬. চট্টগ্রাম-৮, এরশাদ উল্লাহ (প্রাপ্ত ভোট: ১,৫২,৯৬৯)।\n" +
                "৭. চট্টগ্রাম-৯, মোহাম্মদ আবু সুফিয়ান (প্রাপ্ত ভোট: ১,০৯,৩৮৮)।\n" +
                "৮. চট্টগ্রাম-১০, সাঈদ আল নোমান (প্রাপ্ত ভোট: ১,১৪,৬৭৮)।\n" +
                "৯. চট্টগ্রাম-১১, আমির খসরু মাহমুদ চৌধুরী (প্রাপ্ত ভোট: ১,১৩,৯৯৯)।\n" +
                "১০. চট্টগ্রাম-১২, মোহাম্মদ এনামুল হক (প্রাপ্ত ভোট: ১,৩৫,০৪৪)।\n" +
                "১১. চট্টগ্রাম-১৩, সরওয়ার জামাল নিজাম (প্রাপ্ত ভোট: ১,২৬,১৯২)।\n" +
                "১২. চট্টগ্রাম-১৪, আলহাজ্ব জসীম উদ্দীন আহমেদ (প্রাপ্ত ভোট: ৭৬,৪৯৩)।\n" +
                "\n" +
                "চাঁদপুর\n" +
                "\n" +
                "১. চাঁদপুর-১, আ ন ম এহছানুল হক মিলন (প্রাপ্ত ভোট: ১,৩৩,১৬২)।\n" +
                "২. চাঁদপুর-২, মো. জালাল উদ্দিন (প্রাপ্ত ভোট: ১,৭০,৫৮৩)।\n" +
                "৩. চাঁদপুর-৩, শেখ ফরিদ আহম্মেদ (প্রাপ্ত ভোট: ১,৬৫,৪০৪)।\n" +
                "৪. চাঁদপুর-৫, মো. মমিনুল হক (প্রাপ্ত ভোট: ১,৮০,০৯১)।\n" +
                "\n" +
                "জামালপুর\n" +
                "\n" +
                "১. জামালপুর-১, এম রশিদুজ্জামান মিল্লাত (প্রাপ্ত ভোট: ১,৭২,০১১)।\n" +
                "২. জামালপুর-২, এ, ই, সুলতান মাহমুদ বাবু (প্রাপ্ত ভোট: ৯৫,৩৮৭)।\n" +
                "৩. জামালপুর-৩, মো. মোস্তাফিজুর রহমান বাবুল (প্রাপ্ত ভোট: ২,০৬,২১৪)।\n" +
                "৪. জামালপুর-৪, মো. ফরিদুল কবীর তালুকদার (প্রাপ্ত ভোট: ১,৪৬,৫৪৬)।\n" +
                "৫. জামালপুর-৫, শাহ মোঃ ওয়ারেছ আলী মামুন (প্রাপ্ত ভোট: ১,৯৮,২৯২)।\n" +
                "\n" +
                "জয়পুরহাট\n" +
                "\n" +
                "১. জয়পুরহাট-২, মো. আব্দুল বারী (প্রাপ্ত ভোট: ১,৫৮,০৬৫)।\n" +
                "\n" +
                "ঝালকাঠী\n" +
                "\n" +
                "১. ঝালকাঠী-১, রফিকুল ইসলাম জামাল (প্রাপ্ত ভোট: ৬২,০১০)।\n" +
                "২. ঝালকাঠী-২, ইসরাত সুলতানা ইলেন ভূট্টো (প্রাপ্ত ভোট: ১,১৩,১০০)।\n" +
                "\n" +
                "ঝিনাইদহ\n" +
                "\n" +
                "১. ঝিনাইদহ-১, মো. আসাদুজ্জামান (প্রাপ্ত ভোট: ১,৬২,২৭৭)।\n" +
                "\n" +
                "টাঙ্গাইল\n" +
                "\n" +
                "১. টাঙ্গাইল-১, ফকির মাহবুব আনাম (প্রাপ্ত ভোট: ১,৫৩,৯৩২)।\n" +
                "২. টাঙ্গাইল-২, মো. আবদুস সালাম পিন্টু (প্রাপ্ত ভোট: ১,৯৮,২১৩)।\n" +
                "৩. টাঙ্গাইল-৪, মোঃ লুৎফর রহমান (প্রাপ্ত ভোট: ২,১০,৬৮৪)।\n" +
                "৪. টাঙ্গাইল-৫, সুলতান সালাউদ্দিন টুকু (প্রাপ্ত ভোট: ১,৩১,২৭৯)।\n" +
                "৫. টাঙ্গাইল-৬, মোঃ রবিউল আওয়াল (প্রাপ্ত ভোট: ১,৫০,৯৫২)।\n" +
                "৬. টাঙ্গাইল-৭, আবুল কালাম আজাদ সিদ্দিকী (প্রাপ্ত ভোট: ১,৪১,২৫৩)।\n" +
                "৭. টাঙ্গাইল-৮, আহমেদ আযম খান (প্রাপ্ত ভোট: ১,১৪,২১৭)।\n" +
                "\n" +
                "ঠাকুরগাঁও\n" +
                "\n" +
                "১. ঠাকুরগাঁও-১, মির্জা ফখরুল ইসলাম আলমগীর (প্রাপ্ত ভোট: ২,৩৪,১৪৪)।\n" +
                "২. ঠাকুরগাঁও-২, মো. আব্দুস সালাম (প্রাপ্ত ভোট: ১,২১,০১৭)।\n" +
                "৩. ঠাকুরগাঁও-৩, মোঃ জাহিদুর রহমান (প্রাপ্ত ভোট: ১,৩২,৮৭৬)।\n" +
                "\n" +
                "ঢাকা\n" +
                "\n" +
                "১. ঢাকা-১, খোন্দকার আবু আশফাক (প্রাপ্ত ভোট: ১,৭৩,৭৮১)।\n" +
                "২. ঢাকা-২, মো. আমানউল্লাহ আমান (প্রাপ্ত ভোট: ১,৯০,৯৭৬)।\n" +
                "৩. ঢাকা-৩, গয়েশ্বর চন্দ্র রায় (প্রাপ্ত ভোট: ১,৬০,৪২৮)।\n" +
                "৪. ঢাকা-৬, ইশরাক হোসেন (প্রাপ্ত ভোট: ৯৮,৭৮৫)।\n" +
                "৫. ঢাকা-৭, হামিদুর রহমান (প্রাপ্ত ভোট: ৭৮,১৪১)।\n" +
                "৬. ঢাকা-৮, মির্জা আব্বাস উদ্দিন আহমেদ (প্রাপ্ত ভোট: ১,০৪,৬৬৬)।\n" +
                "৭. ঢাকা-৯, হাবিবুর রশিদ (প্রাপ্ত ভোট: ৫৯,৩৬৬)।\n" +
                "৮. ঢাকা-১০, শেখ রবিউল আলম (প্রাপ্ত ভোট: ৮০,৪৩৬)।\n" +
                "৯. ঢাকা-১৩, ববি হাজ্জাজ (প্রাপ্ত ভোট: ৮৮,৩৮৭)।\n" +
                "১০. ঢাকা-১৭, তারেক রহমান (প্রাপ্ত ভোট: ৭২,৬৯৯)।\n" +
                "১১. ঢাকা-১৮, এস, এম, জাহাঙ্গীর হোসেন (প্রাপ্ত ভোট: ১,৪৪,৭১৫)।\n" +
                "১২. ঢাকা-১৯, দেওয়ান মোহাম্মদ সালাউদ্দিন (প্রাপ্ত ভোট: ১,৯০,৯৭৬)।\n" +
                "১৩. ঢাকা-২০, মো. তমিজ উদ্দিন (প্রাপ্ত ভোট: ১,৬৩,০২০)।\n" +
                "\n" +
                "দিনাজপুর\n" +
                "\n" +
                "১. দিনাজপুর-১, মো. মনজুরুল ইসলাম (প্রাপ্ত ভোট: ১,১১,২১২)।\n" +
                "২. দিনাজপুর-২, মো. সাদিক রিয়াজ (প্রাপ্ত ভোট: ১,৭৮,৪৮৯)।\n" +
                "৩. দিনাজপুর-৩, সৈয়দ জাহাঙ্গীর আলম (প্রাপ্ত ভোট: ১,৩৮,৮৭৮)।\n" +
                "৪. দিনাজপুর-৪, মো. আখতারুজ্জামান মিয়া (প্রাপ্ত ভোট: ১,৩৯,২০৭)।\n" +
                "৫. দিনাজপুর-৬, আবু জাফর মো. জাহিদ হোসেন (প্রাপ্ত ভোট: ১,৬৬,৭১৭)।\n" +
                "\n" +
                "নওগাঁ\n" +
                "\n" +
                "১. নওগাঁ-১, মো. মোস্তাফিজুর রহমান (প্রাপ্ত ভোট: ২,০৩,৮৮৭)।\n" +
                "২. নওগাঁ-৩, মো. ফজলে হুদা (প্রাপ্ত ভোট: ১,৭৩,৮৬৪)।\n" +
                "৩. নওগাঁ-৪, ইকরামুল বারী টিপু (প্রাপ্ত ভোট: ১,৬৫,৬৪৬)।\n" +
                "৪. নওগাঁ-৫, মো. জাহিদুল ইসলাম ধলু (প্রাপ্ত ভোট: ১,৩৩,৯২৪)।\n" +
                "৫. নওগাঁ-৬, শেখ মো. রেজাউল ইসলাম (প্রাপ্ত ভোট: ১,২৮,৩৬৬)।\n" +
                "\n" +
                "নরসিংদী\n" +
                "\n" +
                "১. নরসিংদী-১, খাইরুল কবির খোকন (প্রাপ্ত ভোট: ১,০৮,০৭০)।\n" +
                "২. নরসিংদী-২, ড, আবদুল মঈন খান (প্রাপ্ত ভোট: ১,৬০,৬৭৬)।\n" +
                "৩. নরসিংদী-৩, মনজুর এলাহী (প্রাপ্ত ভোট: ৯২,৩৫২)।\n" +
                "৪. নরসিংদী-৪, সরদার মো. সাখাওয়াত হোসেন (প্রাপ্ত ভোট: ৮১,৪১৫)।\n" +
                "৫. নরসিংদী-৫, মো. আশরাফ উদ্দিন (প্রাপ্ত ভোট: ১,৬১,৯১২)।\n" +
                "\n" +
                "নাটোর\n" +
                "\n" +
                "১. নাটোর-১, ফারজানা শারমীন (প্রাপ্ত ভোট: ১,৩৫,৫১২)।\n" +
                "২. নাটোর-২, এম, রুহুল কুদ্দুস তালুকদার দুলু (প্রাপ্ত ভোট: ১,০২,১৯৭)।\n" +
                "৩. নাটোর-৩, মো. আনোয়ারুল ইসলাম (প্রাপ্ত ভোট: ১,০৯,৪৮৫)।\n" +
                "৪. নাটোর-৪, মো. আব্দুল আজিজ (প্রাপ্ত ভোট: ১,১৯,৫৮৫)।\n" +
                "\n" +
                "নারায়ণগঞ্জ\n" +
                "\n" +
                "১. নারায়ণগঞ্জ-১, মুস্তাফিজুর রহমান ভূঁইয়া (প্রাপ্ত ভোট: ৯৩,৩০৬)।\n" +
                "২. নারায়ণগঞ্জ-২, মো. নজরুল ইসলাম আজাদ (প্রাপ্ত ভোট: ১,২৯,০৭৩)।\n" +
                "৩. নারায়ণগঞ্জ-৩, আজহারুল ইসলাম মান্নান (প্রাপ্ত ভোট: ১,২৪,২৯১)।\n" +
                "৪. নারায়ণগঞ্জ-৫, আবুল কালাম (প্রাপ্ত ভোট: ১,৫৫,৪০০)।\n" +
                "\n" +
                "নেত্রকোনা\n" +
                "\n" +
                "১. নেত্রকোনা-১, ব্যারিষ্টার কায়সার কামাল (প্রাপ্ত ভোট: ১,১৪,৭৯৯)।\n" +
                "২. নেত্রকোনা-২, মো. আনোয়ারুল হক (প্রাপ্ত ভোট: ১,৫৮,৩৪৩)।\n" +
                "৩. নেত্রকোনা-৩, রফিকুল ইসলাম হিলালী (প্রাপ্ত ভোট: ১,৭১,৩৯৯)।\n" +
                "৪. নেত্রকোনা-৪, মো. লুৎফুজ্জামান বাবর (প্রাপ্ত ভোট: ১,১৮,৪৬৯)।\n" +
                "\n" +
                "নোয়াখালী\n" +
                "\n" +
                "১. নোয়াখালী-১, এ এম মাহবুব উদ্দিন (প্রাপ্ত ভোট: ১,৬০,৮০১)।\n" +
                "২. নোয়াখালী-২, জয়নুল আবদিন ফারুক (প্রাপ্ত ভোট: ১,২৬,৮৩৩)।\n" +
                "৩. নোয়াখালী-৩, মো. বরকত উল্লাহ বুলু (প্রাপ্ত ভোট: ৮৩,৯৮২)।\n" +
                "৪. নোয়াখালী-৪, মো. শাহজাহান (প্রাপ্ত ভোট: ১,৪১,০৩১)।\n" +
                "৫. নোয়াখালী-৫, মোহাম্মদ ফখরুল ইসলাম (প্রাপ্ত ভোট: ২,১৯,১৮২)।\n" +
                "\n" +
                "নড়াইল\n" +
                "\n" +
                "১. নড়াইল-১, বিশ্বাস জাহাঙ্গীর আলম (প্রাপ্ত ভোট: ১,৪৭,৮০৮)।\n" +
                "\n" +
                "পঞ্চগড়\n" +
                "\n" +
                "১. পঞ্চগড়-১, মুহাম্মদ নওশাদ জমির (প্রাপ্ত ভোট: ৯৯,৯৭৫)।\n" +
                "২. পঞ্চগড়-২, ফরহাদ হোসেন আজাদ (প্রাপ্ত ভোট: ১,৭৬,১৬৯)।\n" +
                "\n" +
                "পটুয়াখালী\n" +
                "\n" +
                "১. পটুয়াখালী-১, আলতাফ হোসেন চৌধুরী (প্রাপ্ত ভোট: ১,৭৪,৬৫০)।\n" +
                "২. পটুয়াখালী-৪, এ বি এম মোশাররফ হোসেন (প্রাপ্ত ভোট: ১,৫২,০৮৭)।\n" +
                "\n" +
                "পাবনা\n" +
                "\n" +
                "১. পাবনা-২, এ, কে, এম, সেলিম রেজা হাবিব (প্রাপ্ত ভোট: ১,১৪,০১৩)।\n" +
                "২. পাবনা-৫, মো. শামছুল রহমান শিমুল বিশ্বাস (প্রাপ্ত ভোট: ২,১৫,৪০৬)।\n" +
                "\n" +
                "পিরোজপুর\n" +
                "\n" +
                "১. পিরোজপুর-২, আহম্মদ সোহেল মনজুর (প্রাপ্ত ভোট: ১,৮১,৯২৫)।\n" +
                "২. পিরোজপুর-৩, মো. রুহুল আমীন দুলাল (প্রাপ্ত ভোট: ১,০৫,১৮৫)।\n" +
                "\n" +
                "ফরিদপুর\n" +
                "\n" +
                "১. ফরিদপুর-২, শামা ওবায়েদ ইসলাম (প্রাপ্ত ভোট: ৬৩,৭৯১)।\n" +
                "২. ফরিদপুর-৩, নায়াব ইউসুফ আহমেদ (প্রাপ্ত ভোট: ১,২০,৯০৯)।\n" +
                "৩. ফরিদপুর-৪, মো. শহিদুল ইসলাম (প্রাপ্ত ভোট: ১,৪৭,৮৪৬)।\n" +
                "\n" +
                "ফেনী\n" +
                "\n" +
                "১. ফেনী-১, মুন্সী রফিকুল আলম (প্রাপ্ত ভোট: ১,২৭,৪৪৩)।\n" +
                "২. ফেনী-২, জয়নাল আবদিন (প্রাপ্ত ভোট: ১,১৯,৯০৪)।\n" +
                "৩. ফেনী-৩, আবদুল আউয়াল মিন্টু (প্রাপ্ত ভোট: ১,৩১,২১০)।\n" +
                "\n" +
                "বগুড়া\n" +
                "\n" +
                "১. বগুড়া-১, কাজী রফিকুল ইসলাম (প্রাপ্ত ভোট: ১,৫৭,৪২৫)।\n" +
                "২. বগুড়া-২, মীর শাহে আলম (প্রাপ্ত ভোট: ১,৬৯,৮৬১)।\n" +
                "৩. বগুড়া-৩, মো. আব্দুল মহিত তালুকদার (প্রাপ্ত ভোট: ১,৪৫,০২৪)।\n" +
                "৪. বগুড়া-৪, মো. মোশারফ হোসেন (প্রাপ্ত ভোট: ১,২৭,৪০৬)।\n" +
                "৫. বগুড়া-৫, গোলাম মোহাম্মদ সিরিজ (প্রাপ্ত ভোট: ১,৫৫,৩৩৯)।\n" +
                "৬. বগুড়া-৬, তারেক রহমান (প্রাপ্ত ভোট: ২,৪৮,৮৪১)।\n" +
                "৭. বগুড়া-৭, মোরশেদ মিল্টন (প্রাপ্ত ভোট: ২,১৬,২৮৪)।\n" +
                "\n" +
                "বরগুনা\n" +
                "\n" +
                "১. বরগুনা-২, মো. নূরুল ইসলাম (প্রাপ্ত ভোট: ২,৬২,৫০১)।\n" +
                "\n" +
                "বরিশাল\n" +
                "\n" +
                "১. বরিশাল-১, জহির উদ্দিন স্বপন (প্রাপ্ত ভোট: ৮৯,৪২৮)।\n" +
                "২. বরিশাল-২, সরদার সরফুদ্দিন আহমেদ (প্রাপ্ত ভোট: ৯৯,৪১৮)।\n" +
                "৩. বরিশাল-৩, জয়নুল আবেদীন (প্রাপ্ত ভোট: ১,৪১,২৮০)।\n" +
                "৪. বরিশাল-৪, মো. রাজিব আহসান (প্রাপ্ত ভোট: ৭৮,১৩১)।\n" +
                "৫. বরিশাল-৫, মো. মজিবর রহমান সরওয়ার (প্রাপ্ত ভোট: ১,২৭,১৯২)।\n" +
                "৬. বরিশাল-৬, আবুল হোসেন খান (প্রাপ্ত ভোট: ১,৩০,০০৬)।\n" +
                "\n" +
                "বাগেরহাট\n" +
                "\n" +
                "১. বাগেরহাট-৩, শেখ ফরিদুল ইসলাম (প্রাপ্ত ভোট: ৮১,০৮৭)।\n" +
                "\n" +
                "বান্দরবান\n" +
                "\n" +
                "১. বান্দরবান পার্বত্য জেলা, সাচিং প্রু (প্রাপ্ত ভোট: ১,০২,১৯৩)।\n" +
                "\n" +
                "ব্রাহ্মণবাড়িয়া\n" +
                "\n" +
                "১. ব্রাহ্মণবাড়িয়া-১, এম, এ, হান্নান (প্রাপ্ত ভোট: ১,৪১,৪৫৬)।\n" +
                "২. ব্রাহ্মণবাড়িয়া-৩, মো. খালেদ হোসেন মাহবুব (প্রাপ্ত ভোট: ৬৮,০৯২)।\n" +
                "৩. ব্রাহ্মণবাড়িয়া-৪, মুশফিকুর রহমান (প্রাপ্ত ভোট: ২,০৯,৬৩৬)।\n" +
                "৪. ব্রাহ্মণবাড়িয়া-৫, মো. আবদুল মান্নান (প্রাপ্ত ভোট: ১,৩৮,১২৪)।\n" +
                "\n" +
                "ভোলা\n" +
                "\n" +
                "১. ভোলা-২, মো. হাফিজ ইব্রাহিম (প্রাপ্ত ভোট: ৮৫,৭৬৯)।\n" +
                "২. ভোলা-৩, হাফিজ উদ্দিন আহমদ বীর বিক্রম (প্রাপ্ত ভোট: ১,১৯,০৮৫)।\n" +
                "৩. ভোলা-৪, মোহাম্মদ নূরুল ইসলাম (প্রাপ্ত ভোট: ১,৪৫,৯৯০)।\n" +
                "\n" +
                "মাগুরা\n" +
                "\n" +
                "১. মাগুরা-১, মো. মনোয়ার হোসেন (প্রাপ্ত ভোট: ১,৮৯,৩৫১)।\n" +
                "২. মাগুরা-২, নিতাই রায় চৌধুরী (প্রাপ্ত ভোট: ১,১৩,৫৮৮)।\n" +
                "\n" +
                "মাদারীপুর\n" +
                "\n" +
                "১. মাদারীপুর-২, মো. জাহান্দার আলী মিয়া (প্রাপ্ত ভোট: ১,৪৬,৩৯৬)।\n" +
                "২. মাদারীপুর-৩, আনিছুর রহমান (প্রাপ্ত ভোট: ৬১,৭৪৪)।\n" +
                "\n" +
                "মানিকগঞ্জ\n" +
                "\n" +
                "১. মানিকগঞ্জ-১, এস এ জিনাহ কবীর (প্রাপ্ত ভোট: ১, ৩৭, ৩৭৭)।\n" +
                "২. মানিকগঞ্জ-২, মঈনুল ইসলাম খান (প্রাপ্ত ভোট: ১,৭৫,৭৭৬)।\n" +
                "৩. মানিকগঞ্জ-৩, আফরোজা খানম (প্রাপ্ত ভোট: ১,৬৭,৩৪৫)।\n" +
                "\n" +
                "মুন্সীগঞ্জ\n" +
                "\n" +
                "১. মুন্সীগঞ্জ-১, মো. আব্দুল্লাহ্ (প্রাপ্ত ভোট: ১,৬৭,৫৬২)।\n" +
                "২. মুন্সীগঞ্জ-২, আব্দুস সালাম আজাদ (প্রাপ্ত ভোট: ১,২৪,১৫৮)।\n" +
                "৩. মুন্সীগঞ্জ-৩, মো. কামরুজ্জামান (প্রাপ্ত ভোট: ১,২৪,৬৯১)।\n" +
                "\n" +
                "মৌলভীবাজার\n" +
                "\n" +
                "১. মৌলভীবাজার-১, নাসির উদ্দিন আহমেদ (প্রাপ্ত ভোট: ৯৭,৪৯২)।\n" +
                "২. মৌলভীবাজার-২, মো. শওকতুল ইসলাম (প্রাপ্ত ভোট: ৭৪,৬৩৬)।\n" +
                "৩. মৌলভীবাজার-৩, নাসের রহমান (প্রাপ্ত ভোট: ১,৯৫,৩৪২)।\n" +
                "৪. মৌলভীবাজার-৪, মো. মুজিবুর রহমান চৌধুরী (প্রাপ্ত ভোট: ১,৬৯,৬০৮)।\n" +
                "\n" +
                "ময়মনসিংহ\n" +
                "\n" +
                "১. ময়মনসিংহ-৩, এম ইকবাল হোসেইন (প্রাপ্ত ভোট: ১,১৮,৪৩৮)।\n" +
                "২. ময়মনসিংহ-৪, মো. আবু ওয়াহাব আকন্দ ওয়াহিদ (প্রাপ্ত ভোট: ১,৮১,৪৪৩)।\n" +
                "৩. ময়মনসিংহ-৫, মোহাম্মদ জাকির হোসেন (প্রাপ্ত ভোট: ১,২৮,৯০৬)।\n" +
                "৪. ময়মনসিংহ-৭, ডা. মো. মাহাবুবুর রহমান (প্রাপ্ত ভোট: ৯৯,০৪৯)।\n" +
                "৫. ময়মনসিংহ-৮, লুৎফুল্লাহেল মাজেদ (প্রাপ্ত ভোট: ২,১৬,২৬২)।\n" +
                "৬. ময়মনসিংহ-৯, ইয়াসের খান চৌধুরী (প্রাপ্ত ভোট: ৮৬, ১৯৫)।\n" +
                "৭. ময়মনসিংহ-১০, মোহাম্মদ আক্তারুজ্জামান (প্রাপ্ত ভোট: ৭৫,৫৭৩)।\n" +
                "৮. ময়মনসিংহ-১১, ফখর উদ্দিন আহমেদ (প্রাপ্ত ভোট: ১, ১১, ২০৩)।\n" +
                "\n" +
                "যশোর\n" +
                "\n" +
                "১. যশোর-৩, অনিন্দ্য ইসলাম অমিত (প্রাপ্ত ভোট: ২,০১,৯১৭)।\n" +
                "\n" +
                "রাঙ্গামাটি\n" +
                "\n" +
                "১. রাঙ্গামাটি পার্বত্য জেলা, দীপেন দেওয়ান (প্রাপ্ত ভোট: ২,০১,৮৪৪)।\n" +
                "\n" +
                "রাজবাড়ী\n" +
                "\n" +
                "১. রাজবাড়ী-১, আলী নেওয়াজ মাহমুদ খৈয়ম (প্রাপ্ত ভোট: ১,৫৪,৫৪১)।\n" +
                "২. রাজবাড়ী-২, মো. হারুন-অর-রশিদ (প্রাপ্ত ভোট: ২,৩৭,২৫৪)।\n" +
                "\n" +
                "রাজশাহী\n" +
                "\n" +
                "১. রাজশাহী-২, মো. মিজানুর রহমান মিনু (প্রাপ্ত ভোট: ১,২৫,৬৪৬)।\n" +
                "২. রাজশাহী-৩, মোহাম্মদ শফিকুল হক মিলন (প্রাপ্ত ভোট: ১,৭৬,৪৬৭)।\n" +
                "৩. রাজশাহী-৫, অধ্যাপক নজরুল ইসলাম (প্রাপ্ত ভোট: ১,২৩,৬১২)।\n" +
                "৪. রাজশাহী-৬, মো. আবু সাইদ চাঁদ (প্রাপ্ত ভোট: ১,৪৮,৬৭২)।\n" +
                "\n" +
                "লক্ষ্মীপুর\n" +
                "\n" +
                "১. লক্ষ্মীপুর-১, মো. শাহাদাত হোসেন (প্রাপ্ত ভোট: ৮৫,৪৫৭)।\n" +
                "২. লক্ষ্মীপুর-২, মো. আবুল খায়ের ভূঁইয়া (প্রাপ্ত ভোট: ১,৪০,৩২১)।\n" +
                "৩. লক্ষ্মীপুর-৩, মো. শহীদউদ্দীন চৌধুরী এ্যানি (প্রাপ্ত ভোট: ১,৩৩,৭৬৫)।\n" +
                "৪. লক্ষ্মীপুর-৪, এ,বি,এম আশরাফ উদ্দিন (নিজান) (প্রাপ্ত ভোট: ১,১৪,০২৬)।\n" +
                "\n" +
                "লালমনিরহাট\n" +
                "\n" +
                "১. লালমনিরহাট-১, মো. হাসান রাজীব প্রধান (প্রাপ্ত ভোট: ১,৩৮,৬৮৬)।\n" +
                "২. লালমনিরহাট-২, মো. রোকন উদ্দীন বাবুল (প্রাপ্ত ভোট: ১,২৩,৯৪৬)।\n" +
                "৩. লালমনিরহাট-৩, আসাদুল হাবিব দুলু (প্রাপ্ত ভোট: ১,৩৮,৬৯১)।\n" +
                "\n" +
                "শরিয়তপুর\n" +
                "\n" +
                "১. শরিয়তপুর-১, সাঈদ আহমেদ (প্রাপ্ত ভোট: ৭৭,৩৯৮)।\n" +
                "২. শরিয়তপুর-২, মো. সকিফুর রহমান (কিরন) (প্রাপ্ত ভোট: ১,২৯,৮১৪)।\n" +
                "৩. শরিয়তপুর-৩, মিয়া নুরুদ্দিন আহাম্মেদ অপু (প্রাপ্ত ভোট: ১,০৬,৩৬৮)।\n" +
                "\n" +
                "শেরপুর\n" +
                "\n" +
                "১. শেরপুর-২, মোহাম্মদ ফাহিম চৌধুরী (প্রাপ্ত ভোট: ১,১৮,৪৭২)।\n" +
                "\n" +
                "সিরাজগঞ্জ\n" +
                "\n" +
                "১. সিরাজগঞ্জ-১, মো. সেলিম রেজা (প্রাপ্ত ভোট: ১,১৬,৬১৩)।\n" +
                "২. সিরাজগঞ্জ-২, ইকবাল হাসান মাহমুদ (প্রাপ্ত ভোট: ১,৭৬,৬৩৮)।\n" +
                "৩. সিরাজগঞ্জ-৩, মুহা. আয়নুল হক (প্রাপ্ত ভোট: ১,৮৩,১০১)।\n" +
                "৪. সিরাজগঞ্জ-৫, মো. আমিরুল ইসলাম খান (প্রাপ্ত ভোট: ১,৩৪,৯৮৯)।\n" +
                "৫. সিরাজগঞ্জ-৬, এম, এ, মুহিত (প্রাপ্ত ভোট: ১,৭১,৫০৮)।\n" +
                "\n" +
                "সিলেট\n" +
                "\n" +
                "১. সিলেট-১, খন্দকার আবদুল মুক্তাদীর (প্রাপ্ত ভোট: ১,৭৬,৯৩৬)।\n" +
                "২. সিলেট-২, মোছা. তাহসিনা রুশদীর (প্রাপ্ত ভোট: ১,১৭,৯৫৬)।\n" +
                "৩. সিলেট-৩, মোহাম্মদ আব্দুল মালিক (প্রাপ্ত ভোট: ১,১৫,৪৫০)।\n" +
                "৪. সিলেট-৪, আরিফুল হক চৌধুরী (প্রাপ্ত ভোট: ১,৮৬,৮৪৬)।\n" +
                "৫. সিলেট-৬, এমরান আহমদ চৌধুরী (প্রাপ্ত ভোট: ১,০৯,৯১৭)।\n" +
                "\n" +
                "সুনামগঞ্জ\n" +
                "\n" +
                "১. সুনামগঞ্জ-১, কামরুজ্জামান কামরুল (প্রাপ্ত ভোট: ১,৬১,৭৭৪)।\n" +
                "২. সুনামগঞ্জ-২, মো. নাছির চৌধুরী (প্রাপ্ত ভোট: ৯৯,৫২২)।\n" +
                "৩. সুনামগঞ্জ-৩, মোহাম্মদ কয়ছর আহমেদ (প্রাপ্ত ভোট: ৯৭,৩১৩)।\n" +
                "৪. সুনামগঞ্জ-৪, নূরুল ইসলাম (প্রাপ্ত ভোট: ৯৮,০৯২)।\n" +
                "৫. সুনামগঞ্জ-৫, কলিম উদ্দিন আহমেদ (প্রাপ্ত ভোট: ১,৫১, ৯১৫)।\n" +
                "\n" +
                "হবিগঞ্জ\n" +
                "\n" +
                "১. হবিগঞ্জ-১, রেজা কিবরিয়া (প্রাপ্ত ভোট: ১,১১,০৭৩)।\n" +
                "২. হবিগঞ্জ-২, আবু মনসুর সাখাওয়াত হাসান (প্রাপ্ত ভোট: ১,২৫,২০০)।\n" +
                "৩. হবিগঞ্জ-৩, আলহাজ্ব মোঃ জি কে গউছ (প্রাপ্ত ভোট: ১,৪১,৫২১)।\n" +
                "৪. হবিগঞ্জ-৪, এস, এম, ফয়সল (প্রাপ্ত ভোট: ১,৮৭,০৭২)।");
        hashMap.put("TV_LOGO","https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ0qZ2BhVz6_S6BAqFC6a8A2KafGj4u5M0QIw&s");
        hashMap.put("NEWS_IMAGE","https://asset.news24bd.tv/public/news_images/2026/02/14/1771010924-b59e87f2bbba432e214b9aab3f2dfd2f.jpg?w=828&q=100");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("TV_NAME","RTV");
        hashMap.put("TV_ONER","Bashundhara Group");
        hashMap.put("NEWS_TITLE","নবনির্বাচিত ২৯৭ সংসদ সদস্যদের গেজেট প্রকাশ");
        hashMap.put("NEWS_DEC","শুক্রবার (১৩ ফেব্রুয়ারি) দিবাগত রাতে নির্বাচন কমিশনের সিনিয়র সচিব আখতার আহমেদ স্বাক্ষরিত এই গেজেট প্রকাশ করা হয়।\n" +
                "\n" +
                "এতে বলা হয়, গণপ্রতিনিধিত্ব আদেশ ১৯৭২ (১৯৭২ সালের রাষ্ট্রপতির আদেশ নম্বর-১৫৫) এর অনুচ্ছেদ ৩৯ এর দফা (৪) অনুসারে নির্বাচনি এলাকাসমূহ থেকে জাতীয় সদস্য হিসেবে নির্বাচিত প্রার্থীদের নাম, পিতা/স্বামীর নাম, মাতার নাম ও ঠিকানা প্রকাশ করা হয়েছে।\n\nসংসদ নির্বাচনে প্রদত্ত ভোটের হার ৫৯ দশমিক ৪৪ শতাংশ। আর গণভোটে কাস্ট হওয়া ভোটের হার ৬০ দশমিক ২৬ শতাংশ। গণভোটে পরিবর্তনের পক্ষে অর্থাৎ ‘হ্যাঁ’ ভোট পড়েছে ৪ কোটি ৮০ লাখ ৭৪ হাজার ৪২৯টি। আর বিপক্ষে বা ‘না’ ভোট পড়েছে ২ কোটি ২৫ লাখ ৬৫ হাজার ৬২৭টি।\n" +
                "\n" +
                "এবারের নির্বাচনে মোট ভোটার ছিল ১২ কোটি ৭৭ লাখ ১১ হাজার ৭৯৩ জন। এর মধ্যে পুরুষ ভোটার ৬ কোটি ৪৮ লাখ ২৫ হাজার ৩৬১ জন, নারী ভোটার ৬ কোটি ২৮ লাখ ৮৫ হাজার ২০০ জন এবং তৃতীয় লিঙ্গের ভোটার ১ হাজার ২৩২ জন। এবারই প্রথম পোস্টাল ব্যালটে ভোট দিয়েছে প্রবাসী বাংলাদেশিরা।\n" +
                "\n" +
                "নির্বাচনে ২ হাজারের মতো প্রার্থী প্রতিদ্বন্দ্বিতা করেছেন। তাদের মধ্যে আড়াই শতাধিক স্বতন্ত্র প্রার্থী, বাকিরা ৫১টি দলের প্রার্থী।\n" +
                "\n" +
                "রাজনৈতিক দলগুলোর মধ্যে সবচেয়ে বেশি প্রার্থী দিয়েছে বিএনপি। দলটির প্রতীক ধানের শীষ নিয়ে নির্বাচনে প্রতিদ্বন্দ্বিতা করেছেন ২৯১ জন প্রার্থী। \n" +
                "এ ছাড়া ইসলামী আন্দোলন বাংলাদেশের ২৫৮ জন প্রার্থী হাতপাখা প্রতীক নিয়ে, বাংলাদেশ জামায়াতে ইসলামীর ২২৯ জন প্রার্থী দাঁড়িপাল্লা প্রতীক নিয়ে এবং জাতীয় নাগরিক পার্টির (এনসিপি) শাপলা কলি প্রতীক নিয়ে নির্বাচন করেছেন ৩২ জন প্রার্থী।");
        hashMap.put("TV_LOGO","https://rtvonline.com/_next/image?url=%2FrtvIcon%2Flive_icon2.png&w=256&q=75");
        hashMap.put("NEWS_IMAGE","https://cdn.rtvonline.com/media/images/2026/2/14/LIopy_20260214_085054378.jpg");
        arrayList.add(hashMap);



    }



}